notes/meeting_2022feb27.org
* meeting notes February 27, 2022
** the raku study group

** usual links to the meeting material
*** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022feb27.md 
*** https://github.com/doomvox/raku-study/tree/main/bin/2022feb27 
** topics
*** Making a hash out of intertwined array of strings and integers
**** categorize
***** https://docs.raku.org/routine/categorize
**** https://www.reddit.com/r/rakulang/comments/skc52i/making_a_hash_out_of_intertwined_array_of_strings/


** bruce gray wants to talk weekly challenge 
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-153/#TASK1
**** https://theweeklychallenge.org/blog/perl-weekly-challenge-153/#TASK2
**** https://github.com/manwar/perlweeklychallenge-club/tree/master/challenge-153/bruce-gray


*** examples
**** https://github.com/Raku/examples

*** issue about doing a ,= with a SetHash on right-hand side
**** https://github.com/rakudo/rakudo/issues/4678
**** discussion goes through a number of oddities about Raku
***** are sets containers, or things-in-themselves?
****** quanthashes don't flatten like hashes (not Iteratable)
***** shades of Russell's Paradox.  
****** lizmat proposes a solution in the direction of ZFC
****** jonathan worthington objects it doesn't go all the way to prohibit indirect self-ref

*** http://clarkema.org/lab/2022/2022-02-09-raku-multiple-grammars/
*** https://www.reddit.com/r/rakulang/comments/ssd1lf/multiple_cooperating_grammars_in_raku_mike_clarke/

*** recursive regexs
**** stackoverflow:
***** https://stackoverflow.com/questions/70913301/what-is-the-correct-raku-recursive-regex-syntax


*** raku grammars
**** https://dev.to/taw/100-languages-speedrun-episode-68-raku-perl-6-grammars-9f0
**** "parrot raiser" pick 






*** darkroast
**** staging area for new roast tests, lower bar to add more tests than to roast
**** talk about on "problemsolving" on github? 

** announcements 
*** February 27th: next raku study group meeting 
*** June 21-25: tprc: perl/raku conference 






